TEXTS = {
  "ask_username": "📧 ایمیل اکانت را وارد کنید:",
  "ask_password": "🔑 رمز عبور را وارد کنید:",
  "login_success": "✅ ورود موفقیت آمیز بود",
  "login_fail": "❌ ورود ناموفق بود. لطفا دوباره تلاش کن.",
  "choose_server": "🌍 یکی از سرور هارو انتخاب کن:",
  "dns_selection": "🧬 یکی از دی ان اس هارو انتخاب کن:",
  "config_saved": "📄 فایل کانفیگ وایرگارد با موفقیت ساخته شد!",
  "no_server": "⚠️ هیچ سروری در دسترس نیست",
  "error": "🚫 خطایی رخ داد. لطفا بعداً تلاش کنید.",
  "warning_text_1": "⚠️ <b>توجه:</b> اگر برای مدتی از کانفیگ استفاده نکنید به صورت خودکار از سرور های رادار گیم حذف می شوند و باید کانفیگ جدید دریافت کنید.",
  "help_text": "1️⃣ برای ساخت اکانت از وبسایت رادار گیم به آدرس https://radar.game/register مراجعه کنید.\n2️⃣ در صورت بروز مشکل هنگام ورود چند دقیقه صبر کنید و بعد دوباره اقدام کنید و در صورت درست نشدن مشکل به @nimazerobit پیام بدید.\n3️⃣ برای اتصال به کانفیگ از نرم افزار رسمی وایرگارد روی ویندوز و اندروید اقدام کنید.\n4️⃣ جهت نیاز به اشتراک گذاری کانفیگ وایرگارد روی کنسول به پیوی من پیام بدید @nimazerobit\n5️⃣ تا حد امکان جهت مشکوک نشدن رادار گیم، دانلود بیشتر از 20 گیگابایت انجام ندهید.",
  "backtomain": "🔙 بازگشت",
  "dev": "<b>⚡️ Powered By <a href='https://t.me/ZeroBitTeam'>Zero Bit ™</a></b>\n<b>🧑‍💻 Dev : @nimazerobit</b>\n<b>⚙️ {version}</b>",
  "profile": "<b>👤 پروفایل شما</b>\n\n<b>• نام:</b> {full_name}\n<b>• یوزرنیم:</b> @{username}\n<b>• شناسه کاربر:</b> <code>{user_id}</code>\n<b>• هش کاربر:</b> <code>{user_hash}</code>\n<b>• تاریخ ثبت‌نام:</b> {created_at} <i>({created_ago} پیش)</i>\n<b>• آخرین فعالیت:</b> {last_active} <i>({last_ago} پیش)</i>\n<b>• تعداد کانفیگ:</b> {config_count}\n<b>• تعداد اکانت رادارگیم:</b> {radargame_count}",
  "cancel_note": "برای لغو دستور از /cancel استفاده کنید 😉",
  "main_menu": {
    "title": "👋 به ربات رادارگیم خوش آمدی!\n\n<b>⚡️ Powered By <a href='https://t.me/ZeroBitTeam'>Zero Bit ™</a></b>\n⚙️ {version}",
    "buttons": {
      "new_config": "🟢 دریافت کانفیگ جدید 🟢",
      "change_account": "🔄 تغییر اکانت",
      "profile": "👤 پروفایل",
      "help": "❓ راهنما"
    }
  },
  "admin": {
    "backtomenu": "🔙 بازگشت به پنل",
    "banned_ok": "<b>🚫 کاربر {uid} بن شد.</b>",
    "unbanned_ok": "<b>✅ کاربر {uid} آن‌بن شد.</b>",
    "user_info": "<b>ℹ️ اطلاعات کاربر</b>\n\n<b>• شناسه:</b> <code>{user_id}</code>\n<b>• یوزرنیم:</b> @{username}\n<b>• نام:</b> {full_name}\n<b>• هش:</b> <code>{user_hash}</code>\n<b>• ثبت‌نام:</b> {created_at} <i>({created_ago} پیش)</i>\n<b>• آخرین فعالیت:</b> {last_active} <i>({last_ago} پیش)</i>\n<b>• تعداد کانفیگ:</b> {config_count}\n<b>• تعداد اکانت رادارگیم:</b> {radargame_count}\n<b>• وضعیت:</b> {status}",
  },
  "errors": {
    "invalid_command": "<b>⚠️ فرمت دستور درست نیست</b>",
    "db_error": "<b>⚠️ خطای داخلی. لطفاً دوباره تلاش کن یا به پشتیبانی پیام بده</b>",
    "user_notfound": "<b>⚠️ کاربر یافت نشد</b>",
  }
}
