TEXTS = {
  "help_text": "1️⃣ برای ساخت اکانت از وبسایت رادار گیم به آدرس https://radar.game/register مراجعه کنید.\n2️⃣ در صورت بروز مشکل هنگام ورود چند دقیقه صبر کنید و بعد دوباره اقدام کنید و در صورت درست نشدن مشکل به @nimazerobit پیام بدید.\n3️⃣ برای اتصال به کانفیگ از نرم افزار رسمی وایرگارد روی ویندوز و اندروید اقدام کنید.\n4️⃣ جهت نیاز به اشتراک گذاری کانفیگ وایرگارد روی کنسول به پیوی من پیام بدید @nimazerobit\n5️⃣ تا حد امکان جهت مشکوک نشدن رادار گیم، دانلود بیشتر از 20 گیگابایت انجام ندهید.",
  "backtomain": "🔙 بازگشت",
  "dev": "<b>⚡️ Powered By <a href='https://t.me/ZeroBitTeam'>Zero Bit ™</a></b>\n<b>🧑‍💻 Dev : @nimazerobit</b>\n<b>⚙️ {version}</b>",
  "profile": "<b>👤 پروفایل شما</b>\n\n<b>• نام:</b> {full_name}\n<b>• یوزرنیم:</b> @{username}\n<b>• شناسه کاربر:</b> <code>{user_id}</code>\n<b>• هش کاربر:</b> <code>{user_hash}</code>\n<b>• تاریخ ثبت‌نام:</b> {created_at} <i>({created_ago} پیش)</i>\n<b>• آخرین فعالیت:</b> {last_active} <i>({last_ago} پیش)</i>\n<b>• تعداد کانفیگ:</b> {config_count}\n<b>• تعداد اکانت رادارگیم:</b> {radargame_count}",
  "required_chat": {
      "message": "🚫 برای استفاده از بات باید در کانال و گروه‌های زیر عضو شوید:",
      "bot_not_joined": "⚠️ ربات در چت {chat_id} ({title}) عضو نیست!",
      "bot_no_access": "❌ دسترسی به چت {chat_id} ({title}) وجود ندارد یا پیدا نشد."
  },
  "main_menu": {
    "title": "👋 به ربات رادارگیم خوش آمدی!\n\n<b>⚡️ Powered By <a href='https://t.me/ZeroBitTeam'>Zero Bit ™</a></b>\n⚙️ {version}",
    "buttons": {
      "new_config": "🟢 دریافت کانفیگ جدید 🟢",
      "change_account": "🔄 تغییر اکانت",
      "profile": "👤 پروفایل",
      "help": "❓ راهنما"
    }
  },
  "admin": {
    "panel_text": "<b>⚙️ پنل مدیریت</b>\n<b>اعلان کاربر جدید:</b> {user_notify_status}\n<b>اعلان کانفیگ جدید:</b> {config_notify_status}",
    "panel_keyboard": {
        "new_user_active": "👤 غیر فعال کردن اعلان ثبت‌نام",
        "new_user_inactive": "👤 فعال کردن اعلان ثبت‌نام",
        "new_config_active": "🔕 غیر فعال کردن اعلان کانفیگ جدید",
        "new_config_inactive": "🔔 فعال کردن اعلان کانفیگ جدید",
        "status": "📊 وضعیت ربات"
    },
    "broadcast": {
        "message": "برای ارسال پیام همگانی، این دستور را روی پیام مورد نظر ریپلای کنید.\nیا یک آیدی عددی بدهید.",
        "result": "✅ <b>ارسال شد</b>\n\n🟢 موفق : {success}\n🔴 ناموفق : {failed}"
    },
    "account_remove": {
        "not_found": "⚠️ هیچ اکانتی برای حذف یافت نشد",
        "result": "✅ تعداد {result} اکانت با موفقیت حذف شد"
    },
    "ban_state_changed": "✅ وضعیت بن کاربر توسط صاحب ربات تغییر کرد",
    "setting_saved": "✅ تنظیمات ذخیره شد",
    "user_info": "<b>ℹ️ اطلاعات کاربر</b>\n\n<b>• شناسه:</b> <code>{user_id}</code>\n<b>• یوزرنیم:</b> @{username}\n<b>• نام:</b> {full_name}\n<b>• هش:</b> <code>{user_hash}</code>\n<b>• ثبت‌نام:</b> {created_at} <i>({created_ago} پیش)</i>\n<b>• آخرین فعالیت:</b> {last_active} <i>({last_ago} پیش)</i>\n<b>• تعداد کانفیگ:</b> {config_count}\n<b>• تعداد اکانت رادارگیم:</b> {radargame_count}\n<b>• وضعیت:</b> {status}",
    "status_result": "<b>📊 آمار ربات</b>\n• کل کاربران: <b>{total_users}</b>\n• تعداد اکانت های رادارگیم: <b>{total_radargame}</b>\n• کاربران بن شده: <b>{banned_users}</b>\n• کاربران فعال امروز: <b>{today_active}</b>\n",
    "backtomenu": "🔙 بازگشت به پنل"
  },
  "radargame": {
      "new_account_button": "➕ افزودن اکانت جدید",
      "no_account_found": "👤 هیچ اکانتی ثبت نشده است",
      "ask_username": "📧 ایمیل اکانت را وارد کنید:",
      "ask_password": "🔑 رمز عبور را وارد کنید:",
      "duplicate_account_error": "⚠️ اکانت با نام کاربری یا ایمیل {username} قبلا اضافه شده است",
      "login_success": "✅ ورود موفقیت آمیز بود",
      "login_fail": "❌ ورود ناموفق بود. لطفا دوباره تلاش کن.",
      "active_account_info": "<b>آیدی تلگرام:</b><pre>{user_id}</pre>\n<b>ایمیل شما: </b><pre>{email}</pre>",
      "add_account_warning": "⚠️ لطفا قبل از دریافت کانفیگ، اکانت جدید اضافه کنید",
      "no_server": "⚠️ هیچ سروری در دسترس نیست",
      "choose_server": "🌍 یکی از سرور هارو انتخاب کن:",
      "server_button_format": "{location} - Load {load}%",
      "dns_selection": "🧬 یکی از دی ان اس هارو انتخاب کن:",
      "cant_load_dns_list": "⚠️ خطا در بارگذاری لیست دی ان اس ها",
      "cant_process_dns_selection": "خطا در پردازش دی ان اس انتخاب شده",
      "config_saved": "📄 فایل کانفیگ وایرگارد با موفقیت ساخته شد!",
      "warning_text_1": "⚠️ <b>توجه:</b> اگر برای مدتی از کانفیگ استفاده نکنید به صورت خودکار از سرور های رادار گیم حذف می شوند و باید کانفیگ جدید دریافت کنید.",
      "new_config_notify_owner": "🆕 <b>کاربری با مشخصات زیر کانفیگ دریافت کرد</b>\n👤 <b>آیدی تلگرام:</b> <code>{user_id}</code>\n👤 <b>اسم اکانت تلگرام:</b> {fullname}\n👤 <b>یوزرنیم تلگرام:</b> @{username}\n📧 <b>یوزرنیم اکانت رادارگیم:</b> <code>{radar_email}</code>\n",
      "change_account": {
          "success": "✅ اکانت فعال با موفقیت تغییر کرد",
          "error": "⚠️ خطا در تغییر اکانت فعال"
      },
      "remove_account": {
          "success": "🗑️ اکانت با موفقیت حذف شد",
          "error": "⚠️ خطا در حذف اکانت"
      },
      "cancel_note": "برای لغو دستور از /cancel استفاده کنید 😉",
  },
  "errors": {
    "access_denied": "⚠️ شما دسترسی لازم ندارید",
    "banned": "⛔️ دسترسی شما مسدود است",
    "invalid_command": "⚠️ فرمت دستور درست نیست",
    "db_error": "⚠️ خطای داخلی. لطفاً دوباره تلاش کن یا به پشتیبانی پیام بده",
    "user_notfound": "⚠️ کاربر یافت نشد",
    "unexpected_error": "🚫 خطایی رخ داد. لطفا بعداً تلاش کنید."
  }
}
